In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [3]:
df

    Column1   Column2   Column3
A -0.549421  0.959898 -0.254006
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [4]:
df > -1

   Column1  Column2  Column3
A     True     True     True
B     True     True     True
C     True     True     True
D     True    False     True

In [5]:
df > 0

   Column1  Column2  Column3
A    False     True    False
B     True    False     True
C     True     True    False
D     True    False    False

In [17]:
booleanDf = df > 0

In [18]:
booleanDf

   Column1  Column2  Column3
A    False     True    False
B     True    False     True
C     True     True    False
D     True    False    False

In [19]:
df[booleanDf]

    Column1   Column2   Column3
A       NaN  0.959898       NaN
B  0.067780       NaN  0.494292
C  1.319703  0.026585       NaN
D  0.229866       NaN       NaN

In [23]:
df[df > 0]

    Column1   Column2   Column3
A       NaN  0.959898       NaN
B  0.067780       NaN  0.494292
C  1.319703  0.026585       NaN
D  0.229866       NaN       NaN

In [24]:
df

    Column1   Column2   Column3
A -0.549421  0.959898 -0.254006
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [25]:
df["Column1"]

A   -0.549421
B    0.067780
C    1.319703
D    0.229866
Name: Column1, dtype: float64

In [26]:
df["Column1"] > 0

A    False
B     True
C     True
D     True
Name: Column1, dtype: bool

In [27]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [28]:
df["Column1"] > 0.5

A    False
B    False
C     True
D    False
Name: Column1, dtype: bool

In [29]:
df[df["Column1"] > 0.5]

    Column1   Column2   Column3
C  1.319703  0.026585 -0.581069

In [30]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [31]:
df[df["Column2"] > 0]

    Column1   Column2   Column3
A -0.549421  0.959898 -0.254006
C  1.319703  0.026585 -0.581069

In [32]:
df[(df["Column1"] > 0) & (df["Column2"] > 0) ]

    Column1   Column2   Column3
C  1.319703  0.026585 -0.581069

In [33]:
df[(df["Column1"] > 0) | (df["Column2"] > 0) ]

    Column1   Column2   Column3
A -0.549421  0.959898 -0.254006
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [34]:
df

    Column1   Column2   Column3
A -0.549421  0.959898 -0.254006
B  0.067780 -0.487083  0.494292
C  1.319703  0.026585 -0.581069
D  0.229866 -1.698612 -0.021414

In [35]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [36]:
df

    Column1   Column2   Column3   Column4
A -0.549421  0.959898 -0.254006  0.292500
B  0.067780 -0.487083  0.494292  0.666369
C  1.319703  0.026585 -0.581069  0.352058
D  0.229866 -1.698612 -0.021414  0.559852

In [37]:
df["Column5"] = randn(4)

In [38]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.549421  0.959898 -0.254006  0.292500 -0.375064
B  0.067780 -0.487083  0.494292  0.666369 -0.746616
C  1.319703  0.026585 -0.581069  0.352058 -0.876829
D  0.229866 -1.698612 -0.021414  0.559852 -0.773810

In [39]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [40]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.549421  0.959898 -0.254006  0.292500 -0.375064  newValue1
B  0.067780 -0.487083  0.494292  0.666369 -0.746616  newValue2
C  1.319703  0.026585 -0.581069  0.352058 -0.876829  newValue3
D  0.229866 -1.698612 -0.021414  0.559852 -0.773810  newValue4

In [43]:
df.set_index("Column6",inplace = True)

In [44]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.549421  0.959898 -0.254006  0.292500 -0.375064
newValue2  0.067780 -0.487083  0.494292  0.666369 -0.746616
newValue3  1.319703  0.026585 -0.581069  0.352058 -0.876829
newValue4  0.229866 -1.698612 -0.021414  0.559852 -0.773810

In [45]:
df.index.names

FrozenList(['Column6'])